In [ ]:
import numpy as np 
import pandas as pd

### Creating a DataFrame

In [3]:
data = {
    'Name': ['John', 'Anna', 'Peter', 'Linda'],
    'Age': [28, 34, 29, 42],
    'City': ['New York', 'Paris', 'Berlin', 'London'],
    'Salary': [65000, 70000, 62000, 85000]
}

In [4]:
data

{'Name': ['John', 'Anna', 'Peter', 'Linda'],
 'Age': [28, 34, 29, 42],
 'City': ['New York', 'Paris', 'Berlin', 'London'],
 'Salary': [65000, 70000, 62000, 85000]}

In [5]:
df = pd.DataFrame(data=data)
df

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [6]:
data_list = [
    ['John', 28, 'New York', 65000],
    ['Anna', 34, 'Paris', 70000],
    ['Peter', 29, 'Berlin', 62000],
    ['Linda', 42, 'London', 85000]
]

data_list

[['John', 28, 'New York', 65000],
 ['Anna', 34, 'Paris', 70000],
 ['Peter', 29, 'Berlin', 62000],
 ['Linda', 42, 'London', 85000]]

In [7]:
df2 = pd.DataFrame(data_list)
columns = ["Name","Age","City","Salary"]
df2  = pd.DataFrame(data_list,columns=columns)
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

### Selection and Indexing of Columns

In [8]:
df2

    Name  Age      City  Salary
0   John   28  New York   65000
1   Anna   34     Paris   70000
2  Peter   29    Berlin   62000
3  Linda   42    London   85000

In [9]:
df["Age"]

0    28
1    34
2    29
3    42
Name: Age, dtype: int64

In [10]:
df[["Name","City"]]

    Name      City
0   John  New York
1   Anna     Paris
2  Peter    Berlin
3  Linda    London

### Creating a new column

In [11]:
df2["Designation"] = ["Doctor","Eng.","Doctor","Eng."]

In [12]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000        Eng.
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000        Eng.

### Removing Columns

In [13]:
df2.drop(0,axis=0)

    Name  Age    City  Salary Designation
1   Anna   34   Paris   70000        Eng.
2  Peter   29  Berlin   62000      Doctor
3  Linda   42  London   85000        Eng.

### Selecting Rows

In [24]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000        Eng.
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000        Eng.

In [20]:
df2.loc[[0,1]]

   Name  Age      City  Salary Designation
0  John   28  New York   65000      Doctor
1  Anna   34     Paris   70000        Eng.

In [23]:
df2.iloc[[0,1]][["Salary","City"]]

   Salary      City
0   65000  New York
1   70000     Paris

### Conditional Selection

In [25]:
df2

    Name  Age      City  Salary Designation
0   John   28  New York   65000      Doctor
1   Anna   34     Paris   70000        Eng.
2  Peter   29    Berlin   62000      Doctor
3  Linda   42    London   85000        Eng.

In [26]:
#I only want to see those people whose age is above 30

In [31]:
df2[df2["Age"] > 34]

    Name  Age    City  Salary Designation
3  Linda   42  London   85000        Eng.

In [28]:
#I only want people whose age is above 30 and their city must be pair

In [38]:
df2[(df2["Age"] > 30) & (df2["City"] == 'Paris')]

   Name  Age   City  Salary Designation
1  Anna   34  Paris   70000        Eng.